In [1]:
printme = ["David", "James", 34, 56]

In [3]:
print(printme)

['David', 'James', 34, 56]

In [5]:
prind = list(printme)

In [7]:
print(prind)

['David', 'James', 34, 56]

In [9]:
prind = ("Accessleratuio")
med = list(prind)

In [11]:
print(med)

['A', 'c', 'c', 'e', 's', 's', 'l', 'e', 'r', 'a', 't', 'u', 'i', 'o']

In [13]:
dave = (3,5.6)
print(dave)

(3, 5.6)

In [24]:
num = [5,6,3,8,2,4,6]
findme = 0 in num
print(findme)

False

In [38]:
my_details = {"names": "David", "Age": 45, "School": "Coventry University",  "Post Code": "LE2 7OJ","Number": 67}
print(my_details)

{'names': 'David', 'Age': 45, 'School': 'Coventry University', 'Post Code': 'LE2 7OJ', 'Number': 67}

{'names': 'David', 'Age': 45}

In [42]:
my_details["School"]

'Coventry University'

In [44]:
my_details["Address"] = "45 Cavendish Road"

In [46]:
print(my_details)

{'names': 'David', 'Age': 45, 'School': 'Coventry University', 'Post Code': 'LE2 7OJ', 'Number': 67, 'Address': '45 Cavendish Road'}

In [48]:
del my_details["Address"]

In [50]:
print(my_details)

{'names': 'David', 'Age': 45, 'School': 'Coventry University', 'Post Code': 'LE2 7OJ', 'Number': 67}

In [52]:
len(my_details)

5

In [64]:

my_details. values()

dict_values(['David', 45, 'Coventry University', 'LE2 7OJ', 67])

In [67]:
my_details.items()

dict_items([('names', 'David'), ('Age', 45), ('School', 'Coventry University'), ('Post Code', 'LE2 7OJ'), ('Number', 67)])

In [69]:
students = {"Names": ["David","John","James"], "Score": [56,78,60] }

In [71]:
print(students)

{'Names': ['David', 'John', 'James'], 'Score': [56, 78, 60]}

In [90]:
my_set = {56,56,45,90,34,23}
type(my_set)

set

In [85]:
print(my_set)

{34, 23, 56, 90, 45}

In [94]:
my_set.add(100)
print(my_set)

{34, 100, 23, 56, 90, 45}

In [96]:
my_set.remove(90)

In [98]:
print(my_set)

{34, 100, 23, 56, 45}

In [100]:
set1 = {1,3,5,6}
set2 = {1,2,3,4}

set1.union(set2)

{1, 2, 3, 4, 5, 6}

In [102]:
import numpy as np

In [104]:
num = [5,6,3,8,2,4,6]
num1 = np.array(num)

In [106]:
print(num)

[5, 6, 3, 8, 2, 4, 6]

In [112]:
type(num1)

numpy.ndarray

In [110]:
my_list = [1, 2, 3, 4]             # Define a list

my_array = np.array(my_list)       # Pass the list to np.array()

type(my_array)

numpy.ndarray

In [128]:
my_list1 = [1, 2, 3, 4,4] 
my_list2 = [5, 5, 8, 5,5]

num2 = np.array([my_list1, my_list2])

print(num2)

[[1 2 3 4 4]
 [5 5 8 5 5]]

In [120]:
my_list = [1, 2, 3, 4] 
second_list = [5, 6, 7, 8]

two_d_array = np.array([my_list, second_list])

print(two_d_array)

[[1 2 3 4]
 [5 6 7 8]]

In [130]:
num2.shape

(2, 5)

In [132]:
my_list1 = [1, 2, 3, 4,4] 
my_list2 = [5, 5, 8, 5,5]

num2 = np.array([my_list1, my_list2])

print(num2)

[[1 2 3 4 4]
 [5 5 8 5 5]]

In [134]:
num2.dtype

dtype('int32')

In [136]:
np.identity ( n = 5)

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

In [138]:
import numpy as np

In [140]:
import pandas as pd

In [150]:
tabs = pd.Series(data =[2,3,4,5],
                index = ['SaM', 'Bum', 'Cum', 'Dam'],)

print(tabs)

SaM    2
Bum    3
Cum    4
Dam    5
dtype: int64

In [152]:
tabs = {"Aye": 42, "Score": 89, }

In [154]:
print(tabs)

{'Aye': 42, 'Score': 89}

In [156]:
shws = pd.Series(tabs)
shws

Aye      42
Score    89
dtype: int64

In [160]:
shws["Score"]

89

In [162]:
shws + shws

Aye       84
Score    178
dtype: int64

In [176]:
tabs = {"name" : ["Joe","Bob","Frans"],
           "age" : np.array([10,15,20]),
           "weight" : (75,123,239),
          }

df = pd.DataFrame(tabs)   # Convert the dict to DataFrame

df

    name  age  weight
0    Joe   10      75
1    Bob   15     123
2  Frans   20     239

In [178]:
tabbs = {"Names": [45,67,56]}
df = pd.DataFrame(tabbs)
df

   Names
0     45
1     67
2     56

In [182]:
giv = {"University Name": ["Coventry", "Leceister", "Bournmount", "London"],
      "Uinverity Rank" : [1, 7, 4, 6]}
giv

{'University Name': ['Coventry', 'Leceister', 'Bournmount', 'London'],
 'Uinverity Rank': [1, 7, 4, 6]}

In [186]:
jim = pd.DataFrame(giv)
jim

  University Name  Uinverity Rank
0        Coventry               1
1       Leceister               7
2      Bournmount               4
3          London               6

In [192]:
jim["University Name"]

0      Coventry
1     Leceister
2    Bournmount
3        London
Name: University Name, dtype: object

In [194]:
jim = pd.DataFrame(giv)
jim

  University Name  Uinverity Rank
0        Coventry               1
1       Leceister               7
2      Bournmount               4
3          London               6

In [200]:
del jim["Uinverity Rank"]

In [202]:
jim["Registered"] = False

In [204]:
jim

  University Name  Registered
0        Coventry       False
1       Leceister       False
2      Bournmount       False
3          London       False

In [208]:
jim ["Country"] = ["USA", "UK", "Nigeria", ""]

In [210]:
jim

  University Name  Registered  Country
0        Coventry       False      USA
1       Leceister       False       UK
2      Bournmount       False  Nigeria
3          London       False

In [224]:
scoreName = pd.read_csv("ScoreNames.csv")

scoreName

    Names  Score
0    John     56
1   Mercy     87
2  Kindom     65
3  Issack     45
4     Ade     34
5   Funmi     45

In [226]:
scoreName = pd.read_csv("titanic_train.csv")

scoreName

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [230]:
scoreName.shape

(891, 12)

In [234]:
scoreName.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [242]:
scoreName.index = scoreName ["Name"]

In [ ]:
del scoreName["Name"]

In [246]:
tin = scoreName.index = scoreName ["Name"]
tin

Name
Braund, Mr. Owen Harris                                                          Braund, Mr. Owen Harris
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    Cumings, Mrs. John Bradley (Florence Briggs Th...
Heikkinen, Miss. Laina                                                            Heikkinen, Miss. Laina
Futrelle, Mrs. Jacques Heath (Lily May Peel)                Futrelle, Mrs. Jacques Heath (Lily May Peel)
Allen, Mr. William Henry                                                        Allen, Mr. William Henry
                                                                             ...
Montvila, Rev. Juozas                                                              Montvila, Rev. Juozas
Graham, Miss. Margaret Edith                                                Graham, Miss. Margaret Edith
Johnston, Miss. Catherine Helen "Carrie"                        Johnston, Miss. Catherine Helen "Carrie"
Behr, Mr. Karl Howell                                                              Behr, Mr. Karl Howell
Dooley, Mr. Patrick                                                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [250]:
scoreName.index = scoreName["Name"]  # Set index to name
del scoreName["Name"]                    # Delete name column

print(scoreName.index[0:10])

Index(['Braund, Mr. Owen Harris',
       'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
       'Heikkinen, Miss. Laina',
       'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
       'Allen, Mr. William Henry', 'Moran, Mr. James',
       'McCarthy, Mr. Timothy J', 'Palsson, Master. Gosta Leonard',
       'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
       'Nasser, Mrs. Nicholas (Adele Achem)'],
      dtype='object', name='Name')

In [252]:
scoreName.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [262]:
scoreName.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [264]:
scoreName.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [266]:
import os

In [268]:
os.getcwd()

'C:\\Users\\ae0893'

In [270]:
os.listdir('C:/Users/ae0893')

['.anaconda',
 '.conda',
 '.condarc',
 '.continuum',
 '.gitconfig',
 '.idlerc',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.matplotlib',
 '.ms-ad',
 '3D Objects',
 'AppData',
 'Application Data',
 'Contacts',
 'Cookies',
 'data.csv',
 'Data_Exploration.ipynb',
 'Davepreactice.ipynb',
 'David.py',
 'Desktop',
 'Documents',
 'Downloads',
 'Favorites',
 'IntelGraphicsProfiles',
 'Links',
 'Local Settings',
 'Music',
 'My Documents',
 'NetHood',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{2036390c-4e76-11ef-8872-a4b1c1759634}.TxR.0.regtrans-ms',
 'NTUSER.DAT{2036390c-4e76-11ef-8872-a4b1c1759634}.TxR.1.regtrans-ms',
 'NTUSER.DAT{2036390c-4e76-11ef-8872-a4b1c1759634}.TxR.2.regtrans-ms',
 'NTUSER.DAT{2036390c-4e76-11ef-8872-a4b1c1759634}.TxR.blf',
 'NTUSER.DAT{2036390d-4e76-11ef-8872-a4b1c1759634}.TM.blf',
 'NTUSER.DAT{2036390d-4e76-11ef-8872-a4b1c1759634}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{2036390d-4e76-11ef-8872-a4b1c1759634}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'OneDrive',
 'OneDrive - Coventry University',
 'Pictures',
 'PrintHood',
 'PSAppDeployToolkit',
 'PycharmProjects',
 'Recent',
 'Saved Games',
 'ScoreNames.csv',
 'Searches',
 'SendTo',
 'Start Menu',
 'Templates',
 'titanic_train.csv',
 'Untitled.ipynb',
 'Untitled1.ipynb',
 'Untitled2.ipynb',
 'Untitled3.ipynb',
 'Videos',
 'WPS Cloud Files']

In [276]:
import pandas as pd

In [278]:
down1 = pd.read_csv("data.csv")

In [280]:
down1

     Marital status;Application mode;Application order;Course;"Daytime/evening attendance\t";Previous qualification;Previous qualification (grade);Nacionality;Mother's qualification;Father's qualification;Mother's occupation;Father's occupation;Admission grade;Displaced;Educational special needs;Debtor;Tuition fees up to date;Gender;Scholarship holder;Age at enrollment;International;Curricular units 1st sem (credited);Curricular units 1st sem (enrolled);Curricular units 1st sem (evaluations);Curricular units 1st sem (approved);Curricular units 1st sem (grade);Curricular units 1st sem (without evaluations);Curricular units 2nd sem (credited);Curricular units 2nd sem (enrolled);Curricular units 2nd sem (evaluations);Curricular units 2nd sem (approved);Curricular units 2nd sem (grade);Curricular units 2nd sem (without evaluations);Unemployment rate;Inflation rate;GDP;Target
0     1;17;5;171;1;1;122.0;1;19;12;5;9;127.3;1;0;0;1...
1     1;15;1;9254;1;1;160.0;1;1;3;3;3;142.5;1;0;0;0;...
2     1;1;5;9070;1;1;122.0;1;37;37;9;9;124.8;1;0;0;0...
3     1;17;2;9773;1;1;122.0;1;38;37;5;3;119.6;1;0;0;...
4     2;39;1;8014;0;1;100.0;1;37;38;9;9;141.5;0;0;0;...
...                                                 ...
4419  1;1;6;9773;1;1;125.0;1;1;1;5;4;122.2;0;0;0;1;1...
4420  1;1;2;9773;1;1;120.0;105;1;1;9;9;119.0;1;0;1;0...
4421  1;1;1;9500;1;1;154.0;1;37;37;9;9;149.5;1;0;0;1...
4422  1;1;1;9147;1;1;180.0;1;37;37;7;4;153.8;1;0;0;1...
4423  1;10;1;9773;1;1;152.0;22;38;37;5;9;152.0;1;0;0...

[4424 rows x 1 columns]

In [282]:
down1.head()

  Marital status;Application mode;Application order;Course;"Daytime/evening attendance\t";Previous qualification;Previous qualification (grade);Nacionality;Mother's qualification;Father's qualification;Mother's occupation;Father's occupation;Admission grade;Displaced;Educational special needs;Debtor;Tuition fees up to date;Gender;Scholarship holder;Age at enrollment;International;Curricular units 1st sem (credited);Curricular units 1st sem (enrolled);Curricular units 1st sem (evaluations);Curricular units 1st sem (approved);Curricular units 1st sem (grade);Curricular units 1st sem (without evaluations);Curricular units 2nd sem (credited);Curricular units 2nd sem (enrolled);Curricular units 2nd sem (evaluations);Curricular units 2nd sem (approved);Curricular units 2nd sem (grade);Curricular units 2nd sem (without evaluations);Unemployment rate;Inflation rate;GDP;Target
0  1;17;5;171;1;1;122.0;1;19;12;5;9;127.3;1;0;0;1...
1  1;15;1;9254;1;1;160.0;1;1;3;3;3;142.5;1;0;0;0;...
2  1;1;5;9070;1;1;122.0;1;37;37;9;9;124.8;1;0;0;0...
3  1;17;2;9773;1;1;122.0;1;38;37;5;3;119.6;1;0;0;...
4  2;39;1;8014;0;1;100.0;1;37;38;9;9;141.5;0;0;0;...

In [312]:
exam_marks = 60
passmark = 60

if exam_marks < passmark:
    print("Passed the exam")
elif exam_marks == passmark:
    print("Consider exam")
else:
    print("Falied the Exam")

Consider exam

In [374]:
hum = list(range(0,1000,10))
for number in hum:
    print(number)

0
10
20
30
40
50
60
70
80
90
100
110
120
130
140
150
160
170
180
190
200
210
220
230
240
250
260
270
280
290
300
310
320
330
340
350
360
370
380
390
400
410
420
430
440
450
460
470
480
490
500
510
520
530
540
550
560
570
580
590
600
610
620
630
640
650
660
670
680
690
700
710
720
730
740
750
760
770
780
790
800
810
820
830
840
850
860
870
880
890
900
910
920
930
940
950
960
970
980
990

[0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

In [376]:
hum = list(range(0,101,10))
for number in hum:
    print(number)

0
10
20
30
40
50
60
70
80
90
100

In [386]:
for number in hum:
    if number > 500:
        break
    print(number)

0
10
20
30
40
50
60
70
80
90
100

In [ ]:
x = 5
iters = 0

while iters < x:      # Execute the contents as long as iters < x
    print("Study")

In [ ]:
while True:            # True is always true!
    print("Study")
    break

In [ ]:
import numpy as np

# Draw 25 random numbers from -1 to 1
my_data = np.random.uniform(-1,1,25)  

for index, number in enumerate(my_data):  
    if number < 0:               
        my_data[index] = 0            # Set numbers less than 0 to 0

print(my_data)